#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# Completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# Completion styles
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# Keybindings
belak/zsh-utils path:editor

# History
belak/zsh-utils path:history

# Prompt
romkatv/powerlevel10k

# Utilities
zshzoo/macos conditional:is-macos
alberti42/zsh-appearance-control
belak/zsh-utils path:utility
romkatv/zsh-bench kind:path

ohmyzsh/ohmyzsh path:plugins/iterm2

#################
# Developer tools

ohmyzsh/ohmyzsh path:plugins/nvm

# Other Fish-like features
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
